app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dfsdf"], ["rating", "G"], ["description", "sdfsdf"], ["release_date", "2021-10-02 00:00:00"], ["created_at", "2021-10-02 11:08:42.441838"], ["updated_at", "2021-10-02 11:08:42.441838"]]
---
  def create
    Movie.create(params[:movie])

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dfsdf"], ["rating", "G"], ["description", "sdfsdf"], ["release_date", "2021-10-02 00:00:00"], ["created_at", "2021-10-02 11:08:42.441838"], ["updated_at", "2021-10-02 11:08:42.441838"]]
---
  def create
    user_params = params.require(:movie).permit(:title,:rating,:release_date,:description)
    @movie = Movie.create!(user_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "feen"], ["rating", "NC-17"], ["updated_at", "2021-08-21 15:27:34.922472"], ["id", 9]]
---
  def update
    @movie = Movie.find params[:id]
    permitted = params[:movie].permit(:title,:rating,:release_date)
    @movie.update!(permitted)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 9]]
---
  def destroy
    @movie = Movie.find params[:id]
    @movie.destroy